Revit 2027 API
PointLocationOnCurve Constructor
 Constructs a new instance of a class, with given or default values, to place a point on a curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointLocationOnCurve(
	PointOnCurveMeasurementType measType,
	double measValue,
	PointOnCurveMeasureFrom measFrom
)
Public Sub New (
	measType As PointOnCurveMeasurementType,
	measValue As Double,
	measFrom As PointOnCurveMeasureFrom
)
public:
PointLocationOnCurve(
	PointOnCurveMeasurementType measType,
	double measValue,
	PointOnCurveMeasureFrom measFrom
)
new :
        measType : PointOnCurveMeasurementType *
        measValue : float *
        measFrom : PointOnCurveMeasureFrom -> PointLocationOnCurve
Parameters
measType PointOnCurveMeasurementType
measValue Double
measFrom PointOnCurveMeasureFrom
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace